app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "testeeeeeee"], ["description", "testeeeeeeee"], ["created_at", "2021-04-10 23:56:42.708155"], ["updated_at", "2021-04-10 23:56:42.708155"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "testeeeeeeeaaaaaaaa"], ["description", "testeeeeeeeeaaaaaa"], ["updated_at", "2021-04-10 23:56:55.914451"], ["id", 12]]
---
  def update
    if @article.update(article_params)